.svn/pristine/ff/ff121c7546cd2814b26a52132a74920d37cb5014.svn-base

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
    <soap:Header>
      <tem:UserCredential>
         <tem:UserID>RAS</tem:UserID>
         <tem:UserPassword>ril@123</tem:UserPassword>
      </tem:UserCredential>
   </soap:Header>
   <soap:Body>
      <tem:UpdateLead>
         <tem:xmlstring><![CDATA[
         <LEAD>
    <LEADDESCRIPTION>
        <LEADID>___inspection_id___</LEADID>
        <CUSTOMERFNAME>___first_name___</CUSTOMERFNAME>
        <CUSTOMERMNAME>___middle_name___</CUSTOMERMNAME>
        <CUSTOMERLNAME>___last_name___</CUSTOMERLNAME>
        <CUSTOMERADDRESS1>___permanent_address_1___</CUSTOMERADDRESS1>
        <CUSTOMERADDRESS2>___permanent_address_2___</CUSTOMERADDRESS2>
        <CUSTOMERADDRESS3>___permanent_address_3___</CUSTOMERADDRESS3>
        <CUSTOMERCONTACTNO>___mobile___</CUSTOMERCONTACTNO>
        <CUSTOMERTELEPHONENO></CUSTOMERTELEPHONENO>
        <CUSTOMEREMAILID>___email___</CUSTOMEREMAILID>
        <VEHICLEREGNO>___registration_no_1______registration_no_2______registration_no_3______registration_no_4___</VEHICLEREGNO>
        <MAKE>___pb_insurer_vehicle_make_code___</MAKE>
        <MAKEVALUE>___pb_make_name___</MAKEVALUE>
        <MODEL>___pb_insurer_vehicle_model_code___</MODEL>
        <MODELVALUE>___pb_model_name___</MODELVALUE>
        <ENGINENO>___engine_number___</ENGINENO>
        <CHASSISNO>___chassis_number___</CHASSISNO>
        <STATE>___permanent_state_code___</STATE>
        <STATEVALUE>___permanent_state___</STATEVALUE>
        <DISTRICT>___permanent_district_code___</DISTRICT>
        <DISTRICTVALUE>HISAR</DISTRICTVALUE>
        <CITY>___permanent_city_code___</CITY>
        <CITYVALUE>___permanent_city___</CITYVALUE>
        <PINCODE>___permanent_pincode___</PINCODE>
        <VECH_INSP_ADDRESS>___permanent_address_1___</VECH_INSP_ADDRESS>
        <VECH_INSP_ADDRESS2>___permanent_address_2___</VECH_INSP_ADDRESS2>
        <VECH_INSP_ADDRESS3>___permanent_address_3___</VECH_INSP_ADDRESS3>
        <REMARK>GZB</REMARK>
        <LEADTYPE>F</LEADTYPE>
        <STATE_VEH>___permanent_state_code___</STATE_VEH>
        <STATEVALUE_VEH>___permanent_state___</STATEVALUE_VEH>
        <DISTRICT_VEH>___permanent_district_code___</DISTRICT_VEH>
        <DISTRICTVALUE_VEH>HISAR</DISTRICTVALUE_VEH>
        <CITY_VEH>___permanent_city_code___</CITY_VEH>
        <CITYVALUE_VEH>___permanent_city___</CITYVALUE_VEH>
        <PINCODE_VEH>___permanent_pincode___</PINCODE_VEH>        
	<STATUSCODE>2</STATUSCODE>
        <DIST_WITHINCORPORATIONRANGE></DIST_WITHINCORPORATIONRANGE>
        <DIST_OUTSIDECORPORATIONRANGE></DIST_OUTSIDECORPORATIONRANGE>
        <LEADUPDATEDBY>Direct</LEADUPDATEDBY>
        <INSPECTIONDONEBYAGENCYDATETIME>___inspection_date___</INSPECTIONDONEBYAGENCYDATETIME>
        <AGENCYREFNO>321321231</AGENCYREFNO>
        <AGENCY_CODE>1000001</AGENCY_CODE>
    </LEADDESCRIPTION>
</LEAD>
         ]]></tem:xmlstring>
      </tem:UpdateLead>
   </soap:Body>
</soap:Envelope>